1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаИзготовлениеФорм</Name>
			<BasedOn>
				<xr:Item>Catalog.Лико_Формы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ИсторияДвиженийФорм</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полимер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийИзготвленияФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПластины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Растр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяФорма</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеределки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПоОснованию

#КонецОбласти

#Область Инициализация

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		Растр			=150;
		ТолщинаПластины	=1.14;

	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ЗаказКлиента") Тогда
			ЗаполнитьПоЗаказу(ДанныеЗаполнения.ЗаказКлиента);
		КонецЕсли;
		
	КонецЕсли;	
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

#КонецОбласти

#Область Прочее


Процедура ЗаполнитьПоЗаказу(Заказ)
	
	ЗаказКлиента  = Заказ;
	ИмяФайла 	  = Заказ.ИмяФайла;
	Партнер 	  = Заказ.Партнер;
	Контрагент 	  = Заказ.Контрагент;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//Растр = Заказ.Растр;
	
	Если Заказ.Площадка = Справочники.Лико_Площадки.Сибирь Тогда
		
		//Контрагент=Справочники.Контрагенты.НайтиПоНаименованию("ФлексоЦентр ПАРТНЁР ООО");
		Контрагент=Справочники.Лико_ПредопределенныеЗначения.ПоставщикФормЭкофлекс.ЗначениеПараметра;	
		Поставщик=Контрагент.Партнер;  
		
	КонецЕсли; 
	
	РазмерПолимера=Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Заказ);
	//ТолщинаПластины = Заказ.ТолщинаПластины;
	Для Каждого ТекСтрокаЦвета Из Заказ.Цвета Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаЦвета.Форма) и ТекСтрокаЦвета.Цветоделение и 
			//ТекСтрокаЦвета.Форма.ВидПечати=Перечисления.Лико_ВидыПечати.Флексо Тогда
			ТекСтрокаЦвета.Форма.ВидСекции.ВидПечати = Справочники.Лико_ВидыПечати.Флексо Тогда

			НоваяСтрока = Формы.Добавить();
			НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			НоваяСтрока.НоваяФорма = Истина;
			НоваяСтрока.Длина  = РазмерПолимера.Длина;
			НоваяСтрока.Ширина = РазмерПолимера.Ширина;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Форма .УголПоворотаРастра) и
				
				Заказ.Площадка = Справочники.Лико_Площадки.Сибирь Тогда
				
				Документы.Лико_ЗаявкаНаИзготовлениеФорм.ЗаписатьУголПоворотаРастра(НоваяСтрока.Форма);
				
			КонецЕсли;			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	Для каждого СтрФорма Из Формы Цикл
		Если НЕ ЗначениеЗаполнено(СтрФорма.Форма.Заказ) Тогда
			СпрОбъект=СтрФорма.Форма.ПолучитьОбъект();
			СпрОбъект.Заказ=ЗаказКлиента;
			СпрОбъект.Записать();			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры






#КонецОбласти

#КонецОбласти

#КонецЕсли
